app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello, this is the first post created"], ["user_id", 7], ["created_at", "2016-03-20 10:13:04.972398"], ["updated_at", "2016-03-20 10:13:04.972398"]]